# Part 2 Maji Ndogo project: Clustering data to unveil Maji Ndogo's water crisis

#### This part of the project is where we clean and wrangle our data to make it analysis ready
The objectives include:

    1. cleanining our data: specifically the employee table where we will fill the empty email column by creating an email for the employees

    2.  Honouring the workers: find the employees who perfomed exeptionally and recognize them

    3. Analysing locations: understanding where the water sources are 

    4. Diving into the sources: seeing the scope of the problem

    5.  Start of a solution

    6. Analyzing the queues

### Create Emplooyee email and identify the exceptional field surveyors who collected the data

In [1]:
# load sql extension for magic commands
%load_ext sql

In [2]:
# connect to mysql database 
%sql mysql+pymysql://root:********@localhost:3306/md_water_services

Connecting to 'mysql+pymysql://root:***@localhost:3306/md_water_services'

In [3]:
%%sql
SHOW TABLES

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

8 rows affected.

+-----------------------------+
| Tables_in_md_water_services |
+-----------------------------+
|       data_dictionary       |
|           employee          |
|     global_water_access     |
|           location          |
|            visits           |
|        water_quality        |
|         water_source        |
|        well_pollution       |
+-----------------------------+

pull the employees table and clean it

In [4]:
%%sql
SELECT
  *
FROM
  employee
LIMIT
  2

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+----------------------+---------------+---------------+-------+-------------------------+---------------+-----------+----------------+
| assigned_employee_id | employee_name |  phone_number | email |         address         | province_name | town_name |    position    |
+----------------------+---------------+---------------+-------+-------------------------+---------------+-----------+----------------+
|          0           |  Amara Jengo  | +99637993287  |  None | 36 Pwani Mchangani Road |     Sokoto    |   Ilanga  | Field Surveyor |
|          1           |  Bello Azibo  | +99643864786  |  None |  129 Ziwa La Kioo Road  |    Kilimani   |   Rural   | Field Surveyor |
+----------------------+---------------+---------------+-------+-------------------------+---------------+-----------+----------------+

In [ ]:
the email column is empty; create emails for the employees; employee name column is the source, introduce a full stop between the name and concatenate then add
@ndogowater.gov suffix

In [5]:
%%sql
UPDATE employee
SET
  email = employee_name;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

++
||
++
++

In [6]:
%%sql
SELECT
  *
FROM
  employee
LIMIT
  2

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+----------------------+---------------+---------------+-------------+-------------------------+---------------+-----------+----------------+
| assigned_employee_id | employee_name |  phone_number |    email    |         address         | province_name | town_name |    position    |
+----------------------+---------------+---------------+-------------+-------------------------+---------------+-----------+----------------+
|          0           |  Amara Jengo  | +99637993287  | Amara Jengo | 36 Pwani Mchangani Road |     Sokoto    |   Ilanga  | Field Surveyor |
|          1           |  Bello Azibo  | +99643864786  | Bello Azibo |  129 Ziwa La Kioo Road  |    Kilimani   |   Rural   | Field Surveyor |
+----------------------+---------------+---------------+-------------+-------------------------+---------------+-----------+----------------+

In [8]:
%%sql
SELECT
  CONCAT (LOWER(REPLACE (employee_name, " ", "."))) AS new_email
FROM
  employee

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

+----------------+
|   new_email    |
+----------------+
|  amara.jengo   |
|  bello.azibo   |
|  bakari.iniko  |
| malachi.mavuso |
|  cheche.buhle  |
| zuriel.matembo |
|  deka.osumare  |
| lalitha.kaburi |
|  enitan.zuri   |
|   farai.nia    |
+----------------+
Truncated to displaylimit of 10.

In [11]:
%%sql
UPDATE
    employee
SET 
    email = (SELECT
    CONCAT(
    LOWER(REPLACE(employee_name, " ", "."))) #update the column by perfoming a subquery on  
    );

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

++
||
++
++

In [13]:
%%sql
SELECT
    *
FROM
    employee
LIMIT
    2  # check if changes have been made

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+----------------------+---------------+---------------+-------------+-------------------------+---------------+-----------+----------------+
| assigned_employee_id | employee_name |  phone_number |    email    |         address         | province_name | town_name |    position    |
+----------------------+---------------+---------------+-------------+-------------------------+---------------+-----------+----------------+
|          0           |  Amara Jengo  | +99637993287  | amara.jengo | 36 Pwani Mchangani Road |     Sokoto    |   Ilanga  | Field Surveyor |
|          1           |  Bello Azibo  | +99643864786  | bello.azibo |  129 Ziwa La Kioo Road  |    Kilimani   |   Rural   | Field Surveyor |
+----------------------+---------------+---------------+-------------+-------------------------+---------------+-----------+----------------+

In [14]:
%%sql
/* add the @ndogowater.gov suffix*/
UPDATE employee
SET
  email = (CONCAT (email, '@ndogowater.gov'));

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

56 rows affected.

++
||
++
++

In [17]:
%%sql
SELECT
  *
FROM
  employee
LIMIT
  2 /*check if changes have been made*/

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+----------------------+---------------+---------------+----------------------------+-------------------------+---------------+-----------+----------------+
| assigned_employee_id | employee_name |  phone_number |           email            |         address         | province_name | town_name |    position    |
+----------------------+---------------+---------------+----------------------------+-------------------------+---------------+-----------+----------------+
|          0           |  Amara Jengo  | +99637993287  | amara.jengo@ndogowater.gov | 36 Pwani Mchangani Road |     Sokoto    |   Ilanga  | Field Surveyor |
|          1           |  Bello Azibo  | +99643864786  | bello.azibo@ndogowater.gov |  129 Ziwa La Kioo Road  |    Kilimani   |   Rural   | Field Surveyor |
+----------------------+---------------+---------------+----------------------------+-------------------------+---------------+-----------+----------------+

## Honouring workers

In [31]:
%%sql
SELECT
  town_name,
  COUNT(town_name) AS count_employee
FROM
  employee
GROUP BY
  town_name;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

9 rows affected.

+-----------+----------------+
| town_name | count_employee |
+-----------+----------------+
|   Ilanga  |       3        |
|   Rural   |       29       |
|   Lusaka  |       4        |
|  Zanzibar |       4        |
|   Dahabu  |       6        |
|  Kintampo |       1        |
|   Harare  |       5        |
|  Yaounde  |       1        |
|   Serowe  |       3        |
+-----------+----------------+

In [33]:
%%sql
SELECT
  town_name,
  COUNT(town_name) AS count_employee
FROM
  employee
GROUP BY
  town_name
ORDER BY
  count_employee DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

9 rows affected.

+-----------+----------------+
| town_name | count_employee |
+-----------+----------------+
|   Rural   |       29       |
|   Dahabu  |       6        |
|   Harare  |       5        |
|   Lusaka  |       4        |
|  Zanzibar |       4        |
|   Ilanga  |       3        |
|   Serowe  |       3        |
|  Kintampo |       1        |
|  Yaounde  |       1        |
+-----------+----------------+

find the employee with most visits done by grouping visits by count and grouping using the employee id

In [38]:
%%sql
SELECT
    assigned_employee_id,
    COUNT(visit_count) AS no_visits
FROM 
    visits
GROUP BY
    assigned_employee_id
ORDER BY
    no_visits DESC
LIMIT
    3; #limit the results to show the top 3 employees

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+----------------------+-----------+
| assigned_employee_id | no_visits |
+----------------------+-----------+
|          1           |    3708   |
|          30          |    3676   |
|          34          |    3539   |
+----------------------+-----------+

select from both the visits table and emplooyee table to return the name of the employees from employee table

In [42]:
%%sql
SELECT
  e.employee_name,
  COUNT(v.visit_count) AS no_visits
FROM
  employee e
  JOIN visits v ON e.assigned_employee_id = v.assigned_employee_id
GROUP BY
  e.employee_name
ORDER BY
  no_visits DESC
LIMIT
  3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+---------------+-----------+
| employee_name | no_visits |
+---------------+-----------+
|  Bello Azibo  |    3708   |
|   Pili Zola   |    3676   |
|   Rudo Imani  |    3539   |
+---------------+-----------+

In [44]:
%%sql
SELECT
  *
FROM
  location
LIMIT
  2

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+-------------+---------------------+---------------+-----------+---------------+
| location_id |       address       | province_name | town_name | location_type |
+-------------+---------------------+---------------+-----------+---------------+
|  AkHa00000  |  2 Addis Ababa Road |     Akatsi    |   Harare  |     Urban     |
|  AkHa00001  | 10 Addis Ababa Road |     Akatsi    |   Harare  |     Urban     |
+-------------+---------------------+---------------+-----------+---------------+

In [48]:
%%sql
SELECT
  *
FROM
  visits
LIMIT
  2

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
| record_id | location_id |  source_id   |    time_of_record   | visit_count | time_in_queue | assigned_employee_id |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
|     0     |  SoIl32582  | SoIl32582224 | 2021-01-01 09:10:00 |      1      |       15      |          12          |
|     1     |  KiRu28935  | KiRu28935224 | 2021-01-01 09:17:00 |      1      |       0       |          46          |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+

aggregate no of visits and return the name from location table

In [54]:
%%sql
SELECT
  l.town_name,
  COUNT(v.visit_count) AS visit_count
FROM
  location l
  JOIN visits v ON l.location_id = v.location_id
GROUP BY
  l.town_name
ORDER BY
  visit_count DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

25 rows affected.

+-----------+-------------+
| town_name | visit_count |
+-----------+-------------+
|   Rural   |    38741    |
|    Zuri   |     2178    |
|   Harare  |     1860    |
|   Asmara  |     1609    |
|   Dahabu  |     1434    |
|   Amina   |     1328    |
|   Lusaka  |     1245    |
|   Mrembo  |     1144    |
|  Isiqalo  |     903     |
|  Kintampo |     885     |
+-----------+-------------+
Truncated to displaylimit of 10.

In [57]:
%%sql
SELECT
  l.province_name,
  l.town_name,
  COUNT(v.visit_count) AS visit_count
FROM
  location l
  JOIN visits v ON l.location_id = v.location_id
GROUP BY
  l.province_name,
  l.town_name
ORDER BY
  visit_count DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

31 rows affected.

+---------------+-----------+-------------+
| province_name | town_name | visit_count |
+---------------+-----------+-------------+
|     Akatsi    |   Rural   |    10749    |
|    Kilimani   |   Rural   |     9276    |
|     Sokoto    |   Rural   |     8188    |
|    Hawassa    |   Rural   |     6455    |
|     Amanzi    |   Rural   |     4073    |
|    Kilimani   |    Zuri   |     2178    |
|     Amanzi    |   Asmara  |     1609    |
|     Amanzi    |   Dahabu  |     1434    |
|     Akatsi    |   Lusaka  |     1245    |
|    Kilimani   |   Mrembo  |     1144    |
+---------------+-----------+-------------+
Truncated to displaylimit of 10.

In [58]:
%%sql
SELECT
  l.location_type,
  COUNT(v.visit_count) AS visit_count
FROM
  location l
  JOIN visits v ON l.location_id = v.location_id
GROUP BY
  l.location_type
ORDER BY
  visit_count DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+---------------+-------------+
| location_type | visit_count |
+---------------+-------------+
|     Rural     |    38741    |
|     Urban     |    21405    |
+---------------+-------------+

In [ ]:
## deep dive into the water sources

In [ ]:
%%sql
SELECT
  l.location_type,
  COUNT(v.visit_count) AS visit_count
FROM

In [46]:
%sql SHOW TABLES

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

8 rows affected.

+-----------------------------+
| Tables_in_md_water_services |
+-----------------------------+
|       data_dictionary       |
|           employee          |
|     global_water_access     |
|           location          |
|            visits           |
|        water_quality        |
|         water_source        |
|        well_pollution       |
+-----------------------------+

# Exploring the Water sources

In [13]:
%%sql
SELECT
  *
FROM
  water_source
LIMIT
  3;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

3 rows affected.

+--------------+----------------------+-------------------------+
|  source_id   | type_of_water_source | number_of_people_served |
+--------------+----------------------+-------------------------+
| AkHa00000224 |     tap_in_home      |           956           |
| AkHa00001224 |  tap_in_home_broken  |           930           |
| AkHa00002224 |  tap_in_home_broken  |           486           |
+--------------+----------------------+-------------------------+

In [10]:
%%sql
-- show the table related to water_source table
SELECT
  *
FROM
  data_dictionary
WHERE
  related_to LIKE '%water_source%'
  OR table_name = 'water_source';

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

4 rows affected.

+--------------+-------------------------+---------------------------------------------------------------------------------------------------------+--------------+-----------------------------+
|  table_name  |       column_name       |                                               description                                               |   datatype   |          related_to         |
+--------------+-------------------------+---------------------------------------------------------------------------------------------------------+--------------+-----------------------------+
|    visits    |        record_id        |                                     Unique ID assigned to each visit                                    |     int      | water_quality, water_source |
| water_source |        source_id        |                                 Unique ID assigned to each water source                                 | VARCHAR(510) |            visits           |
| water_source |   type_of_water_source  | Type or category of the water source. Can be : tap_in_home, tap_in_home_broken, well, shared_tap, river | VARCHAR(255) |                             |
| water_source | number_of_people_served |                               Number of people served by this water source                              |     INT      |                             |
+--------------+-------------------------+---------------------------------------------------------------------------------------------------------+--------------+-----------------------------+

In [ ]:
from the relationships table above it looks like the water source table is related to the visits table;
- lets look at the visits and water quality to understand this relationship in detail

In [11]:
%%sql
SELECT
  *
FROM
  water_quality
LIMIT
  2;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+-----------+--------------------------+-------------+
| record_id | subjective_quality_score | visit_count |
+-----------+--------------------------+-------------+
|     0     |            0             |      1      |
|     1     |            1             |      1      |
+-----------+--------------------------+-------------+

In [12]:
%%sql
SELECT
  *
FROM
  visits
LIMIT
  2;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
| record_id | location_id |  source_id   |    time_of_record   | visit_count | time_in_queue | assigned_employee_id |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
|     0     |  SoIl32582  | SoIl32582224 | 2021-01-01 09:10:00 |      1      |       15      |          12          |
|     1     |  KiRu28935  | KiRu28935224 | 2021-01-01 09:17:00 |      1      |       0       |          46          |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+

- the visits table records the source_id which is related to the source_id from the water 
source Table; 
Lets answer the following questions:
 1. How many people did we survey in total?
 2. How many wells, taps and rivers are there?
 3. How many people share particular types of water sources on average?
 4. How many people are getting water from each type of source

In [15]:
%%sql
-- 
SELECT
  SUM(number_of_people_served) AS total_people_served
FROM
  water_source

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+---------------------+
| total_people_served |
+---------------------+
|       27628140      |
+---------------------+

In [17]:
%%sql
-- find out the total number of each water source
SELECT
  type_of_water_source,
  COUNT(type_of_water_source) AS count_sources
FROM
  water_source
GROUP BY
  type_of_water_source
ORDER BY
  count_sources DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+---------------+
| type_of_water_source | count_sources |
+----------------------+---------------+
|         well         |     17383     |
|     tap_in_home      |      7265     |
|  tap_in_home_broken  |      5856     |
|      shared_tap      |      5767     |
|        river         |      3379     |
+----------------------+---------------+

In [26]:
%%sql
-- find the average number of people served by each water source
SELECT
  type_of_water_source,
  ROUND(AVG(number_of_people_served), 0) AS avg_people_served
FROM
  water_source
GROUP BY
  type_of_water_source
ORDER BY
  avg_people_served DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+-------------------+
| type_of_water_source | avg_people_served |
+----------------------+-------------------+
|      shared_tap      |        2071       |
|        river         |        699        |
|  tap_in_home_broken  |        649        |
|     tap_in_home      |        644        |
|         well         |        279        |
+----------------------+-------------------+

In [24]:
%%sql
-- find the number of people served by each water source
SELECT
  type_of_water_source,
  SUM(number_of_people_served) AS Total_p_served_per_source
FROM
  water_source
GROUP BY
  type_of_water_source
ORDER BY
  Total_p_served_per_source DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+---------------------------+
| type_of_water_source | Total_p_served_per_source |
+----------------------+---------------------------+
|      shared_tap      |          11945272         |
|         well         |          4841724          |
|     tap_in_home      |          4678880          |
|  tap_in_home_broken  |          3799720          |
|        river         |          2362544          |
+----------------------+---------------------------+

In [36]:
%%sql
SELECT
  SUM(number_of_people_served) AS total_pop
FROM
  water_source

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+-----------+
| total_pop |
+-----------+
|  27628140 |
+-----------+

In [39]:
%%sql 
-- calculate the percentage of people served by each water source
SELECT
  type_of_water_source,
  ROUND(
    (SUM(number_of_people_served) / 27628140) * 100,
    0
  ) AS Percentage_people_served
FROM
  water_source
GROUP BY
  type_of_water_source
ORDER BY
  Percentage_people_served DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+--------------------------+
| type_of_water_source | Percentage_people_served |
+----------------------+--------------------------+
|      shared_tap      |            43            |
|         well         |            18            |
|     tap_in_home      |            17            |
|  tap_in_home_broken  |            14            |
|        river         |            9             |
+----------------------+--------------------------+

### Solving Maji Ndogo Water Crisis
- from the number uncovered above, we are to draft data driven solutions to solve the water crisis

In [ ]:
%%sql 
-- rank the type of water source on the number of people served by the particular source
SELECT
  type_of_water_source,
  SUM(number_of_people_served) AS total_people RANK() OVER (
    ORDER BY
      total_people
  )
FROM
  water_source
GROUP BY
  type_of_water_source;

In [52]:
%%sql
-- rank the type of water_source on the number of people served  
SELECT
  type_of_water_source,
  SUM(number_of_people_served) AS total_people,
  RANK() OVER (
    ORDER BY
      SUM(number_of_people_served) DESC
  ) AS water_source_rank
FROM
  water_source
GROUP BY
  type_of_water_source
ORDER BY
  water_source_rank ASC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

5 rows affected.

+----------------------+--------------+-------------------+
| type_of_water_source | total_people | water_source_rank |
+----------------------+--------------+-------------------+
|      shared_tap      |   11945272   |         1         |
|         well         |   4841724    |         2         |
|     tap_in_home      |   4678880    |         3         |
|  tap_in_home_broken  |   3799720    |         4         |
|        river         |   2362544    |         5         |
+----------------------+--------------+-------------------+

after ranking the water_sources according to the number of people served, we will prioritise the sources 
which serve the most people

In [16]:
%%sql
-- rank the water sources per source and assign rank within each source partion to identify source_id's that should be prioritised
SELECT
  source_id,
  type_of_water_source,
  number_of_people_served,
  RANK() OVER (
    PARTITION BY
      type_of_water_source
    ORDER BY
      number_of_people_served DESC
  ) AS priority_rank
FROM
  water_source;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

39650 rows affected.

+--------------+----------------------+-------------------------+---------------+
|  source_id   | type_of_water_source | number_of_people_served | priority_rank |
+--------------+----------------------+-------------------------+---------------+
| SoRu36791224 |        river         |           998           |       1       |
| SoRu36238224 |        river         |           998           |       1       |
| SoRu36880224 |        river         |           998           |       1       |
| SoRu37756224 |        river         |           998           |       1       |
| SoRu38142224 |        river         |           998           |       1       |
| KiRu30353224 |        river         |           998           |       1       |
| KiZu31236224 |        river         |           998           |       1       |
| KiRu28591224 |        river         |           998           |       1       |
| KiMr25030224 |        river         |           998           |       1       |
| SoRu35837224 |        river         |           998           |       1       |
+--------------+----------------------+-------------------------+---------------+
Truncated to displaylimit of 10.

In [18]:
%%sql
SELECT
  *
FROM
  visits
LIMIT
  2;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

2 rows affected.

+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
| record_id | location_id |  source_id   |    time_of_record   | visit_count | time_in_queue | assigned_employee_id |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
|     0     |  SoIl32582  | SoIl32582224 | 2021-01-01 09:10:00 |      1      |       15      |          12          |
|     1     |  KiRu28935  | KiRu28935224 | 2021-01-01 09:17:00 |      1      |       0       |          46          |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+

Important to note
- the surveyors conducted visits to the diff sources but they visited sources with queues more than 1 time to get a better sense of the queue time

In [25]:
%%sql
-- calculate how long the survey took
SELECT 
    DATEDIFF(MAX(time_of_record), MIN(time_of_record)) AS survey_duration_days
FROM
   visits

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+----------------------+
| survey_duration_days |
+----------------------+
|         924          |
+----------------------+

In [65]:
%%sql
    -- calculate the avg time spent in queues and exclude the values with zero (i.e tap_at_home)
SELECT
    AVG(time_in_queue) AS average_time_in_queue
FROM
    visits
WHERE
    time_in_queue IS NOT NULL   -- Exclude NULLs (though AVG does this automatically)
    AND time_in_queue <> 0;      -- Exclude 0s

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+-----------------------+
| average_time_in_queue |
+-----------------------+
|        123.2574       |
+-----------------------+

In [21]:
%%sql
-- aggregate the time in queues according to the day of the week
SELECT
    DAYNAME(time_of_record) AS day_of_week,
    AVG(time_in_queue) AS avg_queue_time
FROM
    visits
GROUP BY
    DAYNAME(time_of_record)
ORDER BY
    FIELD(day_of_week, 'Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday');

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

7 rows affected.

+-------------+----------------+
| day_of_week | avg_queue_time |
+-------------+----------------+
|    Monday   |    59.6780     |
|   Tuesday   |    47.0795     |
|  Wednesday  |    42.5434     |
|   Thursday  |    46.0164     |
|    Friday   |    52.7397     |
|   Saturday  |    246.2941    |
|    Sunday   |    81.5294     |
+-------------+----------------+

In [7]:
%%sql
--select the avg time spent in queue for each hour of the day
SELECT
     TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
    ROUND(AVG(time_in_queue),0 )AS avg_queue_time
FROM
    visits
GROUP BY
     TIME_FORMAT(TIME(time_of_record), '%H:00')
ORDER BY
    avg_queue_time DESC;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

14 rows affected.

+-------------+----------------+
| hour_of_day | avg_queue_time |
+-------------+----------------+
|    19:00    |      168       |
|    07:00    |      149       |
|    08:00    |      149       |
|    17:00    |      149       |
|    06:00    |      149       |
|    18:00    |      147       |
|    09:00    |       49       |
|    10:00    |       48       |
|    15:00    |       48       |
|    12:00    |       47       |
+-------------+----------------+
Truncated to displaylimit of 10.

In [8]:
%%sql
SELECT
 TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
 DAYNAME(time_of_record),
 CASE
 WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue
 ELSE NULL
 END AS Sunday
 FROM
 visits
 WHERE
 time_in_queue != 0;-- this exludes other sources with 0 queue times.

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

29642 rows affected.

+-------------+-------------------------+--------+
| hour_of_day | DAYNAME(time_of_record) | Sunday |
+-------------+-------------------------+--------+
|    09:00    |          Friday         |  None  |
|    09:00    |          Friday         |  None  |
|    10:00    |          Friday         |  None  |
|    10:00    |          Friday         |  None  |
|    11:00    |          Friday         |  None  |
|    11:00    |          Friday         |  None  |
|    12:00    |          Friday         |  None  |
|    12:00    |          Friday         |  None  |
|    13:00    |          Friday         |  None  |
|    13:00    |          Friday         |  None  |
+-------------+-------------------------+--------+
Truncated to displaylimit of 10.

In [11]:
%%sql
SELECT
  TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
  ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue ELSE NULL END), 0) AS Sunday,
  ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Monday' THEN time_in_queue ELSE NULL END), 0) AS Monday,
  ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Tuesday' THEN time_in_queue ELSE NULL END), 0) AS Tuesday,
  ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Wednesday' THEN time_in_queue ELSE NULL END), 0) AS Wednesday,
  ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Thursday' THEN time_in_queue ELSE NULL END), 0) AS Thursday,
  ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Friday' THEN time_in_queue ELSE NULL END), 0) AS Friday,
  ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Saturday' THEN time_in_queue ELSE NULL END), 0) AS Saturday
FROM
  visits
WHERE
  time_in_queue != 0
GROUP BY
  hour_of_day
ORDER BY
  hour_of_day;

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

14 rows affected.

+-------------+--------+--------+---------+-----------+----------+--------+----------+
| hour_of_day | Sunday | Monday | Tuesday | Wednesday | Thursday | Friday | Saturday |
+-------------+--------+--------+---------+-----------+----------+--------+----------+
|    06:00    |   79   |  190   |   134   |    112    |   134    |  153   |   247    |
|    07:00    |   82   |  186   |   128   |    111    |   139    |  156   |   247    |
|    08:00    |   86   |  183   |   130   |    119    |   129    |  153   |   247    |
|    09:00    |   84   |  127   |   105   |     94    |    99    |  107   |   252    |
|    10:00    |   83   |  119   |    99   |     89    |    95    |  112   |   259    |
|    11:00    |   78   |  115   |   102   |     86    |    99    |  104   |   236    |
|    12:00    |   78   |  115   |    97   |     88    |    96    |  109   |   239    |
|    13:00    |   81   |  122   |    97   |     98    |   101    |  115   |   242    |
|    14:00    |   83   |  127   |   104   |     92    |    96    |  110   |   244    |
|    15:00    |   83   |  126   |   104   |     88    |    92    |  110   |   248    |
+-------------+--------+--------+---------+-----------+----------+--------+----------+
Truncated to displaylimit of 10.

In [ ]:
%%sql

SELECT

FROM

In [41]:
%%sql
SELECT
  *
FROM
  visits

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

60146 rows affected.

+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
| record_id | location_id |  source_id   |    time_of_record   | visit_count | time_in_queue | assigned_employee_id |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
|     0     |  SoIl32582  | SoIl32582224 | 2021-01-01 09:10:00 |      1      |       15      |          12          |
|     1     |  KiRu28935  | KiRu28935224 | 2021-01-01 09:17:00 |      1      |       0       |          46          |
|     2     |  HaRu19752  | HaRu19752224 | 2021-01-01 09:36:00 |      1      |       62      |          40          |
|     3     |  AkLu01628  | AkLu01628224 | 2021-01-01 09:53:00 |      1      |       0       |          1           |
|     4     |  AkRu03357  | AkRu03357224 | 2021-01-01 10:11:00 |      1      |       28      |          14          |
|     5     |  KiRu29315  | KiRu29315224 | 2021-01-01 10:17:00 |      1      |       9       |          40          |
|     6     |  AkRu05234  | AkRu05234224 | 2021-01-01 10:18:00 |      1      |       0       |          30          |
|     7     |  KiRu28520  | KiRu28520224 | 2021-01-01 10:28:00 |      1      |       0       |          34          |
|     8     |  HaZa21742  | HaZa21742224 | 2021-01-01 10:37:00 |      1      |       0       |          6           |
|     9     |  AmDa12214  | AmDa12214224 | 2021-01-01 10:58:00 |      1      |       0       |          36          |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
Truncated to displaylimit of 10.